Revit 2027 API
Extrusion.StartOffset Property
The offset of the start of the extrusion relative to the sketch plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StartOffset { get; set; }
Public Property StartOffset As Double
	Get
	Set
public:
property double StartOffset {
	double get ();
	void set (double value);
}
member StartOffset : float with get, set
Property Value
Double
Remarks
The direction of the offset is based on the normal of the extrusion's sketch plane: a positive value is in the direction of the normal, a negative value is in the other direction.
See Also
Reference
Extrusion Class
Autodesk.Revit.DB Namespace